Documents/ДосрочноеЗакрытиеПакета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ДосрочноеЗакрытиеПакета</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПакетОпционов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПакетыОпционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отвественный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КадрыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДержательПакета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДержателиОпционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусПакетаОпционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусПакетаОпционов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Активен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДосрочноеЗакрытиеПакета/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиентеПроцедура КомандаПровести(Команда)  	ДосрочноеЗакрытиеПакета(ЭтотОбъект.Объект.ПакетОпционов, ЭтотОбъект.Объект.Дата, ЭтотОбъект.Объект.Причина);	
	ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение, Истина);
	Записать(ПараметрыЗаписи);
КонецПроцедуры    Процедура ДосрочноеЗакрытиеПакета(ПакетыОпционов, Дата, Причина)          ОбъектПакета = ПакетыОпционов.ПолучитьОбъект();
	ОбъектПакета.ДатаДосрочногоЗакрытия = ЭтотОбъект.Объект.Дата;
	ОбъектПакета.Статус = Перечисления.СтатусПакетаОпционов.Закрыт; // изменение статуса выбранного акета на "закрыт"    ОбъектПакета.Записать();  	
	Сообщить("Пакет опционов " + ОбъектПакета.Код + " (" + ОбъектПакета.Наименование + ") успешно закрыт по причине '" + ЭтотОбъект.Объект.Причина + "'!");   
КонецПроцедуры   

&НаКлиентеПроцедура ПолучениеФИОДержателяКоманда (Команда)          ПолучениеФИОДержателя();КонецПроцедуры  

Процедура ПолучениеФИОДержателя()
    // получение объекта текущего пакета
    ОбъектПакета = ЭтотОбъект.Объект.ПакетОпционов.ПолучитьОбъект();
    ЭтотОбъект.Объект.ДержательПакета = ОбъектПакета.Держатель;
Конецпроцедуры
